Public Attributes | List of all members
API_LocalCoordsType Struct Reference
Element Manager API
Texture applying parameters. This structure is used in API_LocalCoordsData. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Wrapping  | wrapping
Texturing method.
API_Coord3D  | c0
API_Coord3D  | c1
API_Coord3D  | c2
API_Coord3D  | c3
Detailed Description
Texture applying parameters. This structure is used in API_LocalCoordsData.
Member Data Documentation
◆ c0
 API_Coord3D API_LocalCoordsType::c0
◆ c1
 API_Coord3D API_LocalCoordsType::c1
◆ c2
 API_Coord3D API_LocalCoordsType::c2
◆ c3
 API_Coord3D API_LocalCoordsType::c3
◆ wrapping
 API_LocalCoordsType::wrapping
Texturing method.